{
    "description": [
        "I am a versatile and driven Computer Science professional based in Chicago, IL, with a strong passion for software engineering and problem-solving. I am on track to graduate in May 2025 with a B.S. in Computer Science from the University of Illinois at Chicago, where I maintain a 3.70 GPA. Before transferring, I studied at Michigan State University, earning a 3.83 GPA.",
        "With expertise in multiple programming languages, software development frameworks, and game development technologies, I am always eager to expand my skill set and explore new areas of technology, including deep learning, financial systems, and large-scale software architecture. My experience spans research, freelancing, game development, and industry-level projects, giving me a strong foundation in adapting to new challenges and delivering effective solutions.",
        "One of my most rewarding experiences was working as a Junior Associate Software Engineer at NetherRealm Studios, where I contributed to the development of *Mortal Kombat 1*. Seeing my name in the game’s credits was a defining moment that highlighted the dedication, collaboration, and problem-solving required to bring such a large-scale project to life. This experience reinforced my passion for software engineering and my commitment to building high-performance, impactful systems.",
        "I thrive in fast-paced, collaborative environments where I can apply my technical expertise, solve real-world challenges, and continue learning. My curiosity, adaptability, and drive to push the boundaries of innovation fuel my passion for software development. I am excited to bring my skills, problem-solving abilities, and enthusiasm to a team that values creativity, excellence, and technological growth."
    ],
    "education": [
        {
            "degree": "B.S. in Computer Science",
            "school": "University of Illinois at Chicago",
            "link": "https://www.uic.edu/",
            "location": "Chicago, IL",
            "startCondition": "Started January 2023",
            "endCondition": "Graduating May 2025",
            "gpa": "3.71/4.0"
        },
        {
            "degree": "Computer Science",
            "school": "Michigan State University",
            "link": "https://msu.edu/",
            "location": "East Lansing, MI",
            "startCondition": "Started August 2020",
            "endCondition": "Transferred May 2022",
            "gpa": "3.83/4.0"
        }
    ],
    "seeking": [
        "Opportunities in high-performance computing, low-latency systems, and large-scale software architecture, leveraging deep expertise in C++ and systems-level programming."
    ],
    "favoriteProjects": [
        "Andromeda Game Engine",
        "Dynama Physics Engine",
        "Fractyne"
    ],
    "ongoingProjects": [
        {
            "name": "Professional Website Portfolio",
            "privacy": "Public",
            "status": "In Progress"
        },
        {
            "name": "Fractyne",
            "privacy": "Confidential",
            "status": "In Progress"
        },
        {
            "name": "Andromeda Game Engine",
            "privacy": "Confidential",
            "status": "In Progress"
        }
    ],
    "pendingProjects": [
        {
            "name": "Zeus Quantitative Analysis Engine",
            "reason": "On Hold"
        }
    ],
    "publicationsAndPresentations": [
        {
            "name": "Quantitative Assessment of Tongue-Trackpad Device Accuracy Using a CNC-machine",
            "resource": "/AnnaCarroll-QuantitativeAssessmentOfTongueTrackpadDeviceAccuracyUsingACNCMachine.pdf",
            "type": "Symposium Presentation",
            "involvement": "Co-Author"
        }
    ],
    "contactInfo": {
        "email": "ysperon.work@gmail.com",
        "linkedin": "https://linkedin.com/in/yanni-speron/",
        "github": "https://github.com/YanniSperon"
    }
}